Documents/Замена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Замена</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.МонтажСебестоимостьТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВозврата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаВозврат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаВыдача</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Замена/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если НЕ Константы.МонтажКакРеализация.Получить() Тогда
	//	Сообщить("Документ ""Замена"" используется только когда ""Монтаж"" используется как реализация");
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	ОбновитьФормуДокумента();
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("ДополнительныеПраваЗапретРедактированияЦенВДокументах, ДополнительныеПраваЗапретПримененияСкидок");

	//управление доступностью элементов
	Если РеквизитыПользователя.ДополнительныеПраваЗапретРедактированияЦенВДокументах Тогда
		МассивИменЭлементов = Документы.Замена.ПолучитьМассивРеквизитовПоЦенам();
		ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивИменЭлементов, "ТолькоПросмотр", Истина);
	КонецЕсли;
	//#7771
	Если РеквизитыПользователя.ДополнительныеПраваЗапретПримененияСкидок Тогда
		МассивИменЭлементов = Документы.Замена.ПолучитьМассивРеквизитовПоСкидкам();
		ОбщийМодульКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивИменЭлементов, "ТолькоПросмотр", Истина);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Элементы.ГруппаУчет.Видимость = ПараметрыСеанса.ФинРезультатНекассовыйМетодВеденияУчетаДоходовРасходов;
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	ФинансыСервер.УстановитьОтметкуНезаполненныхСтатейДоходовРасходов(Элементы);
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ВозвратСтатьяДоходов");
	МассивЭлементов.Добавить("ВыдачаСтатьяРасходов");
	ФинансыСервер.УстановитьВидимостьКолонокСтатейДиРВТабличнойЧасти(ЭтаФорма, МассивЭлементов, Истина);
	
	// Видимость колонки Артикул
	МассивЭлементов = новый Массив();
	МассивЭлементов.Добавить("ВозвратНоменклатураАртикул");
	МассивЭлементов.Добавить("ВыдачаНоменклатураАртикул");
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, МассивЭлементов);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// проверяем заполненность статей доходов/расходов
	ФинансыСервер.ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, Объект.ТаблицаВозврат.Количество() > 0, Объект.ТаблицаВыдача.Количество() > 0);
	
КонецПроцедуры

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаСервере
Процедура ПересчитатьСуммуДокумента()
	Объект.СуммаВозврата = Объект.ТаблицаВозврат.Итог("Сумма");
	Объект.СуммаВыдачи = Объект.ТаблицаВыдача.Итог("Сумма");
	Объект.СуммаДокумента = Объект.СуммаВыдачи - Объект.СуммаВозврата;
КонецПроцедуры

&НаСервере
Процедура ОбновитьФормуДокумента()
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьВозвратПоЗаказДоговору(Команда)
	Если Объект.ТаблицаВозврат.Количество() > 0 Тогда
		ПослеВопросаОбОчисткеВозврата = Новый ОписаниеОповещения("ПослеВопросаОбОчисткеВозврата", ЭтаФорма);
		ПоказатьВопрос(ПослеВопросаОбОчисткеВозврата, "Очистить табличную часть ""Возврат""?",РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьВозвратПоЗаказДоговоруНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеВозврата(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
    	Объект.ТаблицаВозврат.Очистить();    
    КонецЕсли;

    ЗаполнитьВозвратПоЗаказДоговоруНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВозвратПоЗаказДоговоруНаСервере()
	
	Для Каждого СтрокаОснования Из Объект.Основание.ТоварыУслуги Цикл
		Если НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(СтрокаОснования.Номенклатура) Тогда
			НоваяСтрока = Объект.ТаблицаВозврат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОснования);
		КонецЕсли;
	КонецЦикла;
	
	ПересчитатьСуммуДокумента();
	ОбновитьФормуДокумента();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказДоговорПриИзменении(Элемент)
	
	ПослеВопросаОПерезаполненииДокумента = Новый ОписаниеОповещения("ПослеВопросаОПерезаполненииДокумента", ЭтаФорма);
	ПоказатьВопрос(ПослеВопросаОПерезаполненииДокумента, "Заполнить таблицу ""Возврат"" по данным выбранного заказ-договора?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОПерезаполненииДокумента(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
    КонецЕсли;

	Объект.ТаблицаВозврат.Очистить();    
    ЗаполнитьВозвратПоЗаказДоговоруНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВозвратПриИзменении(Элемент)
	ПересчитатьСуммуДокумента();
	ОбновитьФормуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыдачаПриИзменении(Элемент)
	ПересчитатьСуммуДокумента();
	ОбновитьФормуДокумента();
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуНоменклатурыПоЗаказу(Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказДоговорТоварыУслуги.Сумма,
	|	ЗаказДоговорТоварыУслуги.Количество,
	|	ВЫБОР
	|		КОГДА ЗаказДоговорТоварыУслуги.Количество = 0
	|			ТОГДА ЗаказДоговорТоварыУслуги.Сумма
	|		ИНАЧЕ ЗаказДоговорТоварыУслуги.Сумма / ЗаказДоговорТоварыУслуги.Количество
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	Документ.ЗаказДоговор.ТоварыУслуги КАК ЗаказДоговорТоварыУслуги
	|ГДЕ
	|	ЗаказДоговорТоварыУслуги.Ссылка = &Ссылка
	|	И ЗаказДоговорТоварыУслуги.Номенклатура = &Номенклатура
	|	И ЗаказДоговорТоварыУслуги.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|	И ЗаказДоговорТоварыУслуги.ЕдиницаИзмерения = &ЕдиницаИзмерения";
	Запрос.УстановитьПараметр("Ссылка",Объект.Основание);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",ЕдиницаИзмерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Окр(Выборка.Цена,2);
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Функция ПолучитьЦенуНоменклатуры(Номенклатура, Знач ХарактеристикаНоменклатуры = Неопределено, ЕдиницаИзмерения = Неопределено, Количество = 1)
		
	Возврат ЦеныКомпании.ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Количество,
												Объект.Основание.Дата, Объект.Основание.ВидЦен, Объект.Основание.Валюта, 												 
												Объект.Основание.Организация, Объект.Основание.Подразделение, 
												Объект.Основание.Контрагент, Объект.Основание.ДоговорКонтрагента);
												
КонецФункции

&НаКлиенте
Процедура ВозвратНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТаблицаВозврат.ТекущиеДанные;
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, СтатьяДоходов");
	СтрокаТабличнойЧасти.Количество = 1;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатурыПоЗаказу(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВозвратХарактеристикаНоменклатурыПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТаблицаВозврат.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатурыПоЗаказу(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ВозвратКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаВозврат.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ВозвратЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаВозврат.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ВозвратСуммаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаВозврат.ТекущиеДанные;
	Если НЕ ТекущаяСтрока = 0 Тогда
		ТекущаяСтрока.Цена = (ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыдачаНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТаблицаВыдача.ТекущиеДанные;
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, СтатьяРасходов");
	СтрокаТабличнойЧасти.Количество = 1;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена;
	СтрокаТабличнойЧасти.ПроцентСкидки = 0;
	СтрокаТабличнойЧасти.СуммаСкидки = 0;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыдачаХарактеристикаНоменклатурыПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТаблицаВыдача.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
	СтрокаТабличнойЧасти.ПроцентСкидки = 0;
	СтрокаТабличнойЧасти.СуммаСкидки = 0;
КонецПроцедуры

&НаКлиенте
Процедура ВыдачаКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаВыдача.ТекущиеДанные;
	СуммаСтроки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	ТекущаяСтрока.Сумма = СуммаСтроки - ТекущаяСтрока.СуммаСкидки;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВозвратЕдиницаИзмеренияПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТаблицаВозврат.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатурыПоЗаказу(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВозвратЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.ТаблицаВозврат.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВозвратЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.ТаблицаВозврат.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыдачаЕдиницаИзмеренияПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТаблицаВыдача.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыдачаЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.ТаблицаВыдача.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыдачаЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.ТаблицаВыдача.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыдачаЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаВыдача.ТекущиеДанные;
	СуммаСтроки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	ТекущаяСтрока.Сумма = СуммаСтроки - ТекущаяСтрока.СуммаСкидки;
КонецПроцедуры

&НаКлиенте
Процедура ВыдачаСуммаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаВыдача.ТекущиеДанные;
	Если НЕ ТекущаяСтрока = 0 Тогда
		ТекущаяСтрока.ПроцентСкидки = 0;
		ТекущаяСтрока.Цена = (ТекущаяСтрока.Сумма + ТекущаяСтрока.СуммаСкидки) / ТекущаяСтрока.Количество;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущаяСтрока)
	Если ТекущаяСтрока.ПроцентСкидки = 100 Тогда
		ТекущаяСтрока.Сумма = 0;
		ТекущаяСтрока.СуммаСкидки = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	Иначе
		Если НЕ ТекущаяСтрока.ПроцентСкидки = 0 Тогда
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена * (1 - ТекущаяСтрока.ПроцентСкидки / 100);
			ТекущаяСтрока.СуммаСкидки = (ТекущаяСтрока.Количество * ТекущаяСтрока.Цена) - ТекущаяСтрока.Сумма;
		Иначе
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
			ТекущаяСтрока.СуммаСкидки = 0;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыдачаПроцентСкидкиПриИзменении(Элемент)
	РассчитатьСуммуСтроки(Элементы.ТаблицаВыдача.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ВыдачаСуммаСкидкиПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаВыдача.ТекущиеДанные;
	Если НЕ ТекущаяСтрока.СуммаСкидки = 0 Тогда
		Если НЕ ТекущаяСтрока.Количество = 0 и НЕ ТекущаяСтрока.Цена = 0 Тогда
			ТекущаяСтрока.ПроцентСкидки = Окр((ТекущаяСтрока.СуммаСкидки / (ТекущаяСтрока.Количество * ТекущаяСтрока.Цена)) * 100,2);
			РассчитатьСуммуСтроки(ТекущаяСтрока);
		Иначе
			ТекущаяСтрока.ПроцентСкидки = 100;
			РассчитатьСуммуСтроки(ТекущаяСтрока);
		КонецЕсли;
	Иначе 
		ТекущаяСтрока.ПроцентСкидки = 0;
		РассчитатьСуммуСтроки(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры
